Repository: Zhanyuanium/local-translate-provider
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# NavGeneral.Content
source: General
zh_cn: 通用

# NavModel.Content
source: Model
zh_cn: 模型

# NavService.Content
source: Service
zh_cn: 服务

# NavAbout.Content
source: About
zh_cn: 关于

# GeneralTitle.Text
source: General
zh_cn: 通用

# RunAtStartupCard.Header
source: Run at startup
zh_cn: 开机自启动

# MinimizeTrayCard.Header
source: Minimize to tray on startup
zh_cn: 启动时最小化到托盘

# ResetButton.Content
source: Reset to default settings
zh_cn: 重置为默认设置

# ModelTitle.Text
source: Model
zh_cn: 模型

# StatusCard.Header
source: Current status
zh_cn: 当前状态

# BackendCard.Header
source: Translation backend
zh_cn: 翻译后端

# FoundryModelCard.Header
source: Foundry Local model
zh_cn: Foundry Local 模型

# StrategyCard.Header
source: Execution strategy
zh_cn: 运行策略

# PowerSavingItem.Content
source: Power saving
zh_cn: 节能

# HighPerfItem.Content
source: High performance
zh_cn: 高性能

# ManualItem.Content
source: Manual device
zh_cn: 手动指定设备

# DeviceCard.Header
source: Device
zh_cn: 设备

# UnloadModelButton.Content
source: Unload model
zh_cn: 卸载模型

# UnloadModelSuccess
source: Model unloaded
zh_cn: 模型已卸载

# SaveButton.Content
source: Save and restart service
zh_cn: 保存并重启服务

# ServiceTitle.Text
source: Service
zh_cn: 服务

# PortCard.Header
source: Port
zh_cn: 端口

# ApiProxyCard.Header
source: API proxy (intercept DeepL/Google)
zh_cn: API 代理（拦截 DeepL/Google）

# ApiProxyHintFormat
source: Set system proxy to 127.0.0.1:{0} and install the CA certificate.
zh_cn: 请将系统代理设为 127.0.0.1:{0}，并安装 CA 证书。

# OpenProxySettingsButton.Content
source: Open proxy settings
zh_cn: 打开代理设置

# ExportCertButton.Content
source: Export CA certificate
zh_cn: 导出 CA 证书

# InstallCertButton.Content
source: Install CA certificate
zh_cn: 安装 CA 证书

# InstallCertSuccessTitle
source: Certificate installed
zh_cn: 证书已安装

# InstallCertSuccessContent
source: CA certificate has been installed to the trusted root store.
zh_cn: CA 证书已安装到受信任的根证书存储。

# InstallCertFailTitle
source: Installation failed
zh_cn: 安装失败

# InstallCertFailContent
source: Could not install automatically. Please export the certificate and install it manually.
zh_cn: 无法自动安装。请导出证书后手动安装。

# EndpointsExpander.Header
source: Simulated endpoints
zh_cn: 模拟端点

# ApiKeyCard.Header
source: API Key (optional)
zh_cn: API Key（可选）

# ApiKeyBox.PlaceholderText
source: Leave empty for no authentication
zh_cn: 留空则无需认证

# AboutTitle.Text
source: About
zh_cn: 关于

# DebugLogCard.Header
source: Enable IPC debug log
zh_cn: 启用 IPC 调试日志

# AboutPlaceholder.Text
source: (To be filled)
zh_cn: （待填充）

# ResetDialogTitle
source: Reset settings
zh_cn: 重置设置

# ResetDialogContent
source: Are you sure you want to restore all settings to their default values?
zh_cn: 确定要将所有设置恢复为默认值吗？

# ResetDialogConfirm
source: OK
zh_cn: 确定

# ResetDialogCancel
source: Cancel
zh_cn: 取消

# StatusPrefix
source: Status:
zh_cn: 状态:

source: Invalid port
zh_cn: 端口无效

# SavedMessage
source: Saved. Service running at http://localhost:{0}
zh_cn: 已保存。服务运行于 http://localhost:{0}

# TrayShowSettings
source: Show settings
zh_cn: 显示设置

# TrayExit
source: Exit
zh_cn: 退出

# StatusReady
source: Ready
zh_cn: 已就绪

# StatusReadyCached
source: Ready (model cached)
zh_cn: 已就绪（模型已缓存）

# StatusNeedDownload
source: Model needs to be downloaded first
zh_cn: 需首次下载模型

# StatusAutoDownloadHint
source: Will auto-download on first translation
zh_cn: 首次翻译时将自动下载

# StatusModelNotFoundFormat
source: Model '{0}' not found
zh_cn: 模型 '{0}' 未找到

# StatusModelNotFoundHint
source: Check model alias or run foundry model list to see available models
zh_cn: 请检查模型别名或运行 foundry model list 查看可用模型

# StatusFoundryUnavailable
source: Foundry Local unavailable
zh_cn: Foundry Local 不可用

# StatusPhiSilicaNotReady
source: Phi Silica not ready
zh_cn: Phi Silica 未就绪

# StatusPhiSilicaNeedDownload
source: Download model or apply for Limited Access token
zh_cn: 需下载模型或申请 Limited Access 令牌

# StatusPhiSilicaUnavailable
source: Phi Silica unavailable (not available in China region, or requires Copilot+ PC)
zh_cn: Phi Silica 不可用（中国区域不可用，或需 Copilot+ PC）
